RT-Thread/rt-thread/bsp/freescale/platform/devices/MK80F25615/include/MK80F25615.h
/* QuadSPI - Register instance definitions */
/* QuadSPI0 */
#define QuadSPI0_MCR                             QuadSPI_MCR_REG(QuadSPI0)
#define QuadSPI0_IPCR                            QuadSPI_IPCR_REG(QuadSPI0)
#define QuadSPI0_FLSHCR                          QuadSPI_FLSHCR_REG(QuadSPI0)
#define QuadSPI0_BUF0CR                          QuadSPI_BUF0CR_REG(QuadSPI0)
#define QuadSPI0_BUF1CR                          QuadSPI_BUF1CR_REG(QuadSPI0)
#define QuadSPI0_BUF2CR                          QuadSPI_BUF2CR_REG(QuadSPI0)
#define QuadSPI0_BUF3CR                          QuadSPI_BUF3CR_REG(QuadSPI0)
#define QuadSPI0_BFGENCR                         QuadSPI_BFGENCR_REG(QuadSPI0)
#define QuadSPI0_SOCCR                           QuadSPI_SOCCR_REG(QuadSPI0)
#define QuadSPI0_BUF0IND                         QuadSPI_BUF0IND_REG(QuadSPI0)
#define QuadSPI0_BUF1IND                         QuadSPI_BUF1IND_REG(QuadSPI0)
#define QuadSPI0_BUF2IND                         QuadSPI_BUF2IND_REG(QuadSPI0)
#define QuadSPI0_SFAR                            QuadSPI_SFAR_REG(QuadSPI0)
#define QuadSPI0_SFACR                           QuadSPI_SFACR_REG(QuadSPI0)
#define QuadSPI0_SMPR                            QuadSPI_SMPR_REG(QuadSPI0)
#define QuadSPI0_RBSR                            QuadSPI_RBSR_REG(QuadSPI0)
#define QuadSPI0_RBCT                            QuadSPI_RBCT_REG(QuadSPI0)
#define QuadSPI0_TBSR                            QuadSPI_TBSR_REG(QuadSPI0)
#define QuadSPI0_TBDR                            QuadSPI_TBDR_REG(QuadSPI0)
#define QuadSPI0_TBCT                            QuadSPI_TBCT_REG(QuadSPI0)
#define QuadSPI0_SR                              QuadSPI_SR_REG(QuadSPI0)
#define QuadSPI0_FR                              QuadSPI_FR_REG(QuadSPI0)
#define QuadSPI0_RSER                            QuadSPI_RSER_REG(QuadSPI0)
#define QuadSPI0_SPNDST                          QuadSPI_SPNDST_REG(QuadSPI0)
#define QuadSPI0_SPTRCLR                         QuadSPI_SPTRCLR_REG(QuadSPI0)
#define QuadSPI0_SFA1AD                          QuadSPI_SFA1AD_REG(QuadSPI0)
#define QuadSPI0_SFA2AD                          QuadSPI_SFA2AD_REG(QuadSPI0)
#define QuadSPI0_SFB1AD                          QuadSPI_SFB1AD_REG(QuadSPI0)
#define QuadSPI0_SFB2AD                          QuadSPI_SFB2AD_REG(QuadSPI0)
#define QuadSPI0_DLPR                            QuadSPI_DLPR_REG(QuadSPI0)
#define QuadSPI0_RBDR0                           QuadSPI_RBDR_REG(QuadSPI0,0)
#define QuadSPI0_RBDR1                           QuadSPI_RBDR_REG(QuadSPI0,1)
#define QuadSPI0_RBDR2                           QuadSPI_RBDR_REG(QuadSPI0,2)
#define QuadSPI0_RBDR3                           QuadSPI_RBDR_REG(QuadSPI0,3)
#define QuadSPI0_RBDR4                           QuadSPI_RBDR_REG(QuadSPI0,4)
#define QuadSPI0_RBDR5                           QuadSPI_RBDR_REG(QuadSPI0,5)
#define QuadSPI0_RBDR6                           QuadSPI_RBDR_REG(QuadSPI0,6)
#define QuadSPI0_RBDR7                           QuadSPI_RBDR_REG(QuadSPI0,7)
#define QuadSPI0_RBDR8                           QuadSPI_RBDR_REG(QuadSPI0,8)
#define QuadSPI0_RBDR9                           QuadSPI_RBDR_REG(QuadSPI0,9)
#define QuadSPI0_RBDR10                          QuadSPI_RBDR_REG(QuadSPI0,10)
#define QuadSPI0_RBDR11                          QuadSPI_RBDR_REG(QuadSPI0,11)
#define QuadSPI0_RBDR12                          QuadSPI_RBDR_REG(QuadSPI0,12)
#define QuadSPI0_RBDR13                          QuadSPI_RBDR_REG(QuadSPI0,13)
#define QuadSPI0_RBDR14                          QuadSPI_RBDR_REG(QuadSPI0,14)
#define QuadSPI0_RBDR15                          QuadSPI_RBDR_REG(QuadSPI0,15)
#define QuadSPI0_LUTKEY                          QuadSPI_LUTKEY_REG(QuadSPI0)
#define QuadSPI0_LCKCR                           QuadSPI_LCKCR_REG(QuadSPI0)
#define QuadSPI0_LUT0                            QuadSPI_LUT_REG(QuadSPI0,0)
#define QuadSPI0_LUT1                            QuadSPI_LUT_REG(QuadSPI0,1)
#define QuadSPI0_LUT2                            QuadSPI_LUT_REG(QuadSPI0,2)
#define QuadSPI0_LUT3                            QuadSPI_LUT_REG(QuadSPI0,3)
#define QuadSPI0_LUT4                            QuadSPI_LUT_REG(QuadSPI0,4)
#define QuadSPI0_LUT5                            QuadSPI_LUT_REG(QuadSPI0,5)
#define QuadSPI0_LUT6                            QuadSPI_LUT_REG(QuadSPI0,6)
#define QuadSPI0_LUT7                            QuadSPI_LUT_REG(QuadSPI0,7)
#define QuadSPI0_LUT8                            QuadSPI_LUT_REG(QuadSPI0,8)
#define QuadSPI0_LUT9                            QuadSPI_LUT_REG(QuadSPI0,9)
#define QuadSPI0_LUT10                           QuadSPI_LUT_REG(QuadSPI0,10)
#define QuadSPI0_LUT11                           QuadSPI_LUT_REG(QuadSPI0,11)
#define QuadSPI0_LUT12                           QuadSPI_LUT_REG(QuadSPI0,12)
#define QuadSPI0_LUT13                           QuadSPI_LUT_REG(QuadSPI0,13)
#define QuadSPI0_LUT14                           QuadSPI_LUT_REG(QuadSPI0,14)
#define QuadSPI0_LUT15                           QuadSPI_LUT_REG(QuadSPI0,15)
#define QuadSPI0_LUT16                           QuadSPI_LUT_REG(QuadSPI0,16)
#define QuadSPI0_LUT17                           QuadSPI_LUT_REG(QuadSPI0,17)
#define QuadSPI0_LUT18                           QuadSPI_LUT_REG(QuadSPI0,18)
#define QuadSPI0_LUT19                           QuadSPI_LUT_REG(QuadSPI0,19)
#define QuadSPI0_LUT20                           QuadSPI_LUT_REG(QuadSPI0,20)
#define QuadSPI0_LUT21                           QuadSPI_LUT_REG(QuadSPI0,21)
#define QuadSPI0_LUT22                           QuadSPI_LUT_REG(QuadSPI0,22)
#define QuadSPI0_LUT23                           QuadSPI_LUT_REG(QuadSPI0,23)
#define QuadSPI0_LUT24                           QuadSPI_LUT_REG(QuadSPI0,24)
#define QuadSPI0_LUT25                           QuadSPI_LUT_REG(QuadSPI0,25)
#define QuadSPI0_LUT26                           QuadSPI_LUT_REG(QuadSPI0,26)
#define QuadSPI0_LUT27                           QuadSPI_LUT_REG(QuadSPI0,27)
#define QuadSPI0_LUT28                           QuadSPI_LUT_REG(QuadSPI0,28)
#define QuadSPI0_LUT29                           QuadSPI_LUT_REG(QuadSPI0,29)
#define QuadSPI0_LUT30                           QuadSPI_LUT_REG(QuadSPI0,30)
#define QuadSPI0_LUT31                           QuadSPI_LUT_REG(QuadSPI0,31)
#define QuadSPI0_LUT32                           QuadSPI_LUT_REG(QuadSPI0,32)
#define QuadSPI0_LUT33                           QuadSPI_LUT_REG(QuadSPI0,33)
#define QuadSPI0_LUT34                           QuadSPI_LUT_REG(QuadSPI0,34)
#define QuadSPI0_LUT35                           QuadSPI_LUT_REG(QuadSPI0,35)
#define QuadSPI0_LUT36                           QuadSPI_LUT_REG(QuadSPI0,36)
#define QuadSPI0_LUT37                           QuadSPI_LUT_REG(QuadSPI0,37)
#define QuadSPI0_LUT38                           QuadSPI_LUT_REG(QuadSPI0,38)
#define QuadSPI0_LUT39                           QuadSPI_LUT_REG(QuadSPI0,39)
#define QuadSPI0_LUT40                           QuadSPI_LUT_REG(QuadSPI0,40)
#define QuadSPI0_LUT41                           QuadSPI_LUT_REG(QuadSPI0,41)
#define QuadSPI0_LUT42                           QuadSPI_LUT_REG(QuadSPI0,42)
#define QuadSPI0_LUT43                           QuadSPI_LUT_REG(QuadSPI0,43)
#define QuadSPI0_LUT44                           QuadSPI_LUT_REG(QuadSPI0,44)
#define QuadSPI0_LUT45                           QuadSPI_LUT_REG(QuadSPI0,45)
#define QuadSPI0_LUT46                           QuadSPI_LUT_REG(QuadSPI0,46)
#define QuadSPI0_LUT47                           QuadSPI_LUT_REG(QuadSPI0,47)
#define QuadSPI0_LUT48                           QuadSPI_LUT_REG(QuadSPI0,48)
#define QuadSPI0_LUT49                           QuadSPI_LUT_REG(QuadSPI0,49)
#define QuadSPI0_LUT50                           QuadSPI_LUT_REG(QuadSPI0,50)
#define QuadSPI0_LUT51                           QuadSPI_LUT_REG(QuadSPI0,51)
#define QuadSPI0_LUT52                           QuadSPI_LUT_REG(QuadSPI0,52)
#define QuadSPI0_LUT53                           QuadSPI_LUT_REG(QuadSPI0,53)
#define QuadSPI0_LUT54                           QuadSPI_LUT_REG(QuadSPI0,54)
#define QuadSPI0_LUT55                           QuadSPI_LUT_REG(QuadSPI0,55)
#define QuadSPI0_LUT56                           QuadSPI_LUT_REG(QuadSPI0,56)
#define QuadSPI0_LUT57                           QuadSPI_LUT_REG(QuadSPI0,57)
#define QuadSPI0_LUT58                           QuadSPI_LUT_REG(QuadSPI0,58)
#define QuadSPI0_LUT59                           QuadSPI_LUT_REG(QuadSPI0,59)
#define QuadSPI0_LUT60                           QuadSPI_LUT_REG(QuadSPI0,60)
#define QuadSPI0_LUT61                           QuadSPI_LUT_REG(QuadSPI0,61)
#define QuadSPI0_LUT62                           QuadSPI_LUT_REG(QuadSPI0,62)
#define QuadSPI0_LUT63                           QuadSPI_LUT_REG(QuadSPI0,63)

